Catalogs/ОснованияПриостановленияТрудовыхДоговоровКонтрактов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ОснованияПриостановленияТрудовыхДоговоровКонтрактов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Часть</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подпункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НормативныеДокументыОснованийКадровыхПриказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абзац</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/НормативныеДокументыОснованийКадровыхПриказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>НормативныеДокументыОснованийКадровыхПриказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТКРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФЗ79</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗРФ31321</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФЗ25</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФЗ41</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФЗ328</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФЗ342</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФЗ113</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УИКРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФЗ114</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФЗ141</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФЗ197</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФЗ403</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ОснованияПриостановленияТрудовыхДоговоровКонтрактов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// ТехнологияСервиса.ВыгрузкаЗагрузкаДанных

// Возвращает реквизиты справочника, которые образуют естественный ключ для элементов справочника.
//
// Возвращаемое значение:
//  Массив из Строка - имена реквизитов, образующих естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("Наименование");
	
	Возврат Результат;
	
КонецФункции

// Конец ТехнологияСервиса.ВыгрузкаЗагрузкаДанных

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ДоступныеОснования = ДоступныеНормативныеДокументыОснований();
	Если ЗначениеЗаполнено(ДоступныеОснования) Тогда
		ОтборСправочника = Новый Структура("ДокументОснование", ДоступныеОснования);
		Параметры.Вставить("Отбор", ОтборСправочника);
	КонецЕсли;
	
	ПредставленияОбщихДанных.ОбработкаПолученияДанныхВыбора(
		Справочники.ОснованияПриостановленияТрудовыхДоговоровКонтрактов, 
		ДанныеВыбора, Параметры, СтандартнаяОбработка);
	
КонецПроцедуры


#КонецЕсли

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	ПредставленияОбщихДанныхВызовСервера.ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка);
КонецПроцедуры

Функция ДоступныеНормативныеДокументыОснований() Экспорт
	
	ДоступныеДокументы = Новый Массив;
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьГосударственнуюСлужбу") Тогда
		ДоступныеДокументы.Добавить(Перечисления.НормативныеДокументыОснованийКадровыхПриказов.ТКРФ);
	КонецЕсли;
	
	Возврат ДоступныеДокументы;
	
КонецФункции

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегламентированныхДанных(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет первоначальное заполнение справочника.
//
Процедура НачальноеЗаполнение() Экспорт
	
	ИмяСправочника = Метаданные.Справочники.ОснованияПриостановленияТрудовыхДоговоровКонтрактов.Имя;
	
	ИмяМакета = ИмяМакетаКлассификатора();
	
	СоответствиеПолей = Новый Соответствие;
	СоответствиеПолей.Вставить("Наименование", "Title");
	СоответствиеПолей.Вставить("ТекстОснования", "Reason");
	
	КлючиПоиска = Новый Структура;
	КлючиПоиска.Вставить("КлючиПоискаСправочника", "Наименование");
	КлючиПоиска.Вставить("КлючиПоискаМакета", "Title");
	
	КонтрактыДоговорыСотрудников.ЗаполнитьСправочникИзМакетаКлассификатора(ИмяСправочника, ИмяМакета, СоответствиеПолей, КлючиПоиска);
	
КонецПроцедуры

Функция ИмяМакетаКлассификатора()
	Возврат "ОснованияПриостановленияТрудовыхДоговоровКонтрактов";
КонецФункции

#КонецОбласти

#КонецЕсли
